sw-backend/app/controllers/sessions_controller.rb

  def create
    user = User.find_for_database_authentication(email: params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = ''  ORDER BY "users"."id" ASC LIMIT 1

  def destroy
    current_user.authentication_token = nil
    current_user.save!
---
UPDATE "users" SET "current_sign_in_at" = ?, "last_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["current_sign_in_at", "2014-06-20 14:24:43.717092"], ["last_sign_in_at", "2014-06-20 14:12:58.647039"], ["sign_in_count", 4], ["updated_at", "2014-06-20 14:24:43.717598"]]