sw-backend/app/controllers/api/categories_controller.rb

    def index
      render json: Category.all, root:false;
---
SELECT "categories".* FROM "categories"