sw-backend/app/controllers/api/edges_controller.rb

SELECT "edges".* FROM "edges"
---
    def index
      render json: Edge.all, root:false

INSERT INTO "requirements" ("created_at", "mode", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-20 15:28:50.423113"], ["mode", "rank"], ["updated_at", "2014-06-20 15:28:50.423113"], ["value", "Novice"]]
INSERT INTO "edges" ("category_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 2], ["created_at", "2014-06-20 15:30:58.278454"], ["name", "dsaf"], ["updated_at", "2014-06-20 15:30:58.278454"]]
---
    def create
      rank = Requirement.create(mode: 'rank', value: params["rank"]["name"])

      edge = Edge.new
      edge.name = params[:name]
      edge.category_id = params["category"]["id"]
      edge.requirements = [ rank ]
      edge.save

SELECT  "edges".* FROM "edges"  WHERE "edges"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "edges" WHERE "edges"."id" = 5
---
    def destroy
      edge = Edge.find(params[:id])
      edge.delete